const descriptions = [
  {
    title: "Василий Архипов",
    description:
      "В частности, сплочённость команды профессионалов способствует повышению качества позиций, занимаемых участниками в отношении поставленных задач. Есть над чем задуматься: стремящиеся вытеснить традиционное производство, нанотехнологии неоднозначны и будут заблокированы в рамках своих собственных рациональных ограничений. В целом, конечно, консультация с широким активом позволяет оценить значение экономической целесообразности принимаемых решений. В своём стремлении повысить качество жизни, они забывают, что высокое качество позиционных исследований предопределяет высокую востребованность поставленных обществом задач. Сложно сказать, почему многие известные личности заблокированы в рамках своих собственных рациональных ограничений. Являясь всего лишь частью общей картины, действия представителей оппозиции будут обнародованы. Разнообразный и богатый опыт говорит нам, что начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании поэтапного и последовательного развития общества. Также как синтетическое тестирование требует определения и уточнения экспериментов, поражающих по своей масштабности и грандиозности. Наше дело не так однозначно, как может показаться: экономическая повестка сегодняшнего дня позволяет выполнить важные задания по разработке своевременного выполнения сверхзадачи. Повседневная практика показывает, что дальнейшее развитие различных форм деятельности не оставляет шанса для соответствующих условий активизации.",
  },
  {
    title: "Антон Коваленко",
    description:
      "Имеется спорная точка зрения, гласящая примерно следующее: многие известные личности неоднозначны и будут разоблачены. Идейные соображения высшего порядка, а также сплочённость команды профессионалов, в своём классическом представлении, допускает внедрение распределения внутренних резервов и ресурсов. В своём стремлении улучшить пользовательский опыт мы упускаем, что активно развивающиеся страны третьего мира представляют собой не что иное, как квинтэссенцию победы маркетинга над разумом и должны быть объективно рассмотрены соответствующими инстанциями. Есть над чем задуматься: элементы политического процесса функционально разнесены на независимые элементы. Разнообразный и богатый опыт говорит нам, что экономическая повестка сегодняшнего дня не оставляет шанса для дальнейших направлений развития. Для современного мира начало повседневной работы по формированию позиции однозначно фиксирует необходимость распределения внутренних резервов и ресурсов. С другой стороны, убеждённость некоторых оппонентов представляет собой интересный эксперимент проверки первоочередных требований! А ещё элементы политического процесса смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности. Следует отметить, что граница обучения кадров не оставляет шанса для инновационных методов управления процессами. Банальные, но неопровержимые выводы, а также многие известные личности, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.",
  },
  {
    title: "Андрей Власов",
    description:
      "И нет сомнений, что интерактивные прототипы набирают популярность среди определенных слоев населения, а значит, должны быть объективно рассмотрены соответствующими инстанциями. Безусловно, новая модель организационной деятельности играет определяющее значение для системы массового участия. Имеется спорная точка зрения, гласящая примерно следующее: диаграммы связей, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут преданы социально-демократической анафеме. Банальные, но неопровержимые выводы, а также реплицированные с зарубежных источников, современные исследования формируют глобальную экономическую сеть и при этом — призваны к ответу. Прежде всего, постоянное информационно-пропагандистское обеспечение нашей деятельности говорит о возможностях соответствующих условий активизации. Банальные, но неопровержимые выводы, а также многие известные личности неоднозначны и будут описаны максимально подробно! Разнообразный и богатый опыт говорит нам, что курс на социально-ориентированный национальный проект играет важную роль в формировании кластеризации усилий. Кстати, активно развивающиеся страны третьего мира набирают популярность среди определенных слоев населения, а значит, должны быть смешаны с не уникальными данными до степени совершенной неузнаваемости, из-за чего возрастает их статус бесполезности. Картельные сговоры не допускают ситуации, при которой многие известные личности и по сей день остаются уделом либералов, которые жаждут быть объединены в целые кластеры себе подобных! Сложно сказать, почему базовые сценарии поведения пользователей описаны максимально подробно.",
  },
  {
    title: "Иосиф Виссарионович",
    description:
      "Значимость этих проблем настолько очевидна, что экономическая повестка сегодняшнего дня позволяет оценить значение дальнейших направлений развития. Идейные соображения высшего порядка, а также современная методология разработки создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса приоретизации разума над эмоциями. Равным образом, высококачественный прототип будущего проекта требует анализа позиций, занимаемых участниками в отношении поставленных задач. В рамках спецификации современных стандартов, явные признаки победы институционализации освещают чрезвычайно интересные особенности картины в целом, однако конкретные выводы, разумеется, ограничены исключительно образом мышления. В своём стремлении повысить качество жизни, они забывают, что укрепление и развитие внутренней структуры не даёт нам иного выбора, кроме определения новых предложений. Предварительные выводы неутешительны: начало повседневной работы по формированию позиции не оставляет шанса для новых принципов формирования материально-технической и кадровой базы. И нет сомнений, что многие известные личности превращены в посмешище, хотя само их существование приносит несомненную пользу обществу. Наше дело не так однозначно, как может показаться: существующая теория создаёт предпосылки для кластеризации усилий. Разнообразный и богатый опыт говорит нам, что синтетическое тестирование требует от нас анализа своевременного выполнения сверхзадачи. А ещё многие известные личности рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок.",
  },
];

const searcherButton = document.getElementById("searcherbutton");
const searcherInput = document.getElementById("seracherinput");
const container = document.getElementById("cardContainer");
const template = (data) => `
  <ul>
    <li>${data.title}</li>
    <li>${data.description}</li>
  </ul>
  `;

searcherButton.onclick = function () {
  if (searcherInput.value != "") {
    container.innerHTML = "";
    for (const [key, value] of Object.entries(descriptions)) {
      if (
        value.title.indexOf(searcherInput.value) != -1 ||
        value.description.indexOf(searcherInput.value) != -1
      ) {
        container.innerHTML += template(value);
      }
    }
  }
};

// var searchtext,
//   searchtexts = {};
// document.getElementById("searcherbutton").onclick = function () {
//   console.clear();
//   searchtext = document.getElementById("seracherinput").value;
//   for (var i = 0; i < Object.keys(dictionary).length; i++) {
//     if (dictionary[i].indexOf(searchtext) != -1) {
//       console.log(dictionary[i]);
//     }
//   }
// };

// for (let i = 0; i < descriptions.length; i++) {
//   container.innerHTML += template(descriptions[i]);
// }
