const people = [
  {
    name: "Клочков<br>Василий",
    title: "Василий Георгиевич Клочков",
    birthdate: "Дата рождения: 8 марта 1911 года",
    birthplace: "Место рождения: село Локоть, Российская империя",
    bio: `Клочков Василий Георгиевич - военный комиссар 4-й роты 2-го
            батальона 1075-го стрелкового полка 316-й стрелковой дивизии 16-й
            армии Западного фронта, младший политрук. <br /><br />В 1921 году во
            время голода в Поволжье вместе с родными уехал на Алтай. В пути от
            голода погиб отец, самому пришлось беспризорничать, с 1922 года
            батрачил у зажиточных крестьян. Жил в селе Локоть, с 1925 года
            работал счетоводом сельпо и заведующим избой-читальней. В 1929 году
            окончил школу крестьянской молодёжи в селе Локоть Локтевского
            района. <br /><br />С 1931 года жил и работал в Пензе, затем в
            Саратове. В августе 1940 года окончил Всесоюзный институт заочного
            обучения Наркомторга СССР. С 1940 года жил в Алма-Ате Казахской ССР.
            С мая 1941 года работал заместителем управляющего трестом столовых и
            ресторанов города Алма-Аты. Член ВКП(б) с 1939 года.
            <br /><br />Военный комиссар 4-й стрелковой роты 2-го стрелкового
            батальона 1075-го стрелкового полка (316-я стрелковая дивизия, 16-я
            армия, Западный фронт) младший политрук Василий Клочков 16 ноября
            1941 года во главе группы истребителей танков у железнодорожного
            разъезда Дубосеково Волоколамского района Московской области отражал
            многочисленные атаки противника. Группа, вошедшая в историю битвы
            под Москвой и Великой Отечественной войны, как 28
            героев-панфиловцев, уничтожила восемнадцать танков.`,
  },
  {
    name: "Ананьев<br>Николай",
    title: "Николай Яковлевич Ананьев",
    birthdate: "Дата рождения: 19 ноября 1912 года",
    birthplace: "Место рождения:Село Сазановка",
    bio: `
В июле 1941 года Ананьев Н. Я. призван Иссык-Кульским районным Военным комиссариатом Иссык-Кульской области Киргизской ССР в Рабоче-крестьянскую Красную Армию (РККА), — красноармеец, рядовой-пехотинец 316-й пехотной стрелковой дивизии (316 СД), сформированной в Алма-Ате под командованием генерал-майора И. В. Панфилова (до этого бывший военный комиссар Киргизской ССР). В августе 1941 — в числе личного состава дивизии отправлен на Западный фронт под Новгород в распоряжение запланированной к формированию 52-й резервной армии; 27 августа 1941 года дивизия полностью выгрузились в Боровичах, и к 8 сентября 1941 дивизия, где заняла позиции во втором эшелоне армии и почти месяц дивизия оборудует полосу обороны.
<br><br>
16 ноября 1941 года на линии обороны — у железнодорожного разъезда Дубосеково Волоколамского района Московской области 316-я СД вела ожесточённые оборонительные бои. Красноармеец 4-й роты 2-го батальона 1075-го стрелкового полка 316 СД — рядовой Николай Ананьев, в составе группы бойцов-истребителей танков — в ходе затяжного боя, отражавшего танковые атаки противника из 50 танков, задержав вражеское наступление на 4 часа, и уничтожив при этом 18 вражеских танков и несколько сотен солдат противника, — погиб в числе других бойцов-красноармейцев, встав на пути продвижения вражеских войск к Москве[2]. Данный подвиг советских воинов вошёл в историю, как легендарный подвиг 28 героев-панфиловцев.
`,
  },
  {
    name: "Безродных<br>Григорий",
    title: "Григорий Михеевич Безродных",
    birthdate: "Дата рождения: 24 февраля 1909 года",
    birthplace: "Место рождения:Село Урыв-Покровка",
    bio: `
  Родился в 1909 году в селе Урыв Коротоякского уезда Воронежской губернии (ныне — село Урыв-Покровка в Острогожском районе Воронежской области) в крестьянской семье Михея Михеевича Безродных. Украинец.
<br><br>
В июле 1941 года Григорий Безродных был вновь призван в Красную Армию и отправлен на фронт. 16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков[3]. Это сражение вошло в историю как подвиг 28 героев-панфиловцев. В этом бою Григорий Безродных погиб. Похоронен в братской могиле у деревни Нелидово Волоколамского района Московской области.
`,
  },
  {
    name: "Болотов<br>Николай",
    title: "Михеевич николай Болотов",
    birthdate: "Дата рождения: 1911 год",
    birthplace: "Место рождения:Село Белашово",
    bio: `
    Родился в 1911 году в селе Белашово ныне Кордайского района Жамбылской области Казахстана в крестьянской семье Никанора Белашева. Русский. Окончил начальную школу, работал кузнецом. <br><br>
    В Красной Армии с 1941 года. Участник Великой Отечественной войны с 1941 года. <br><br>
    16 ноября 1941 года в бою у разъезда Дубосеково Волоколамского района Московской области в составе группы истребителей танков во главе с политруком В. Г. Клочковым и сержантом И. Е. Добробабиным отражал многочисленные атаки танков и пехоты противника. Группа, вошедшая в историю битвы под Москвой и Великой Отечественной войны, как 28 героев-панфиловцев, уничтожила восемнадцать танков. <br><br>
    Погиб в этом бою. Похоронен в братской могиле у деревни Нелидово Волоколамского района Московской области. <br><br>
    `,
  },
  {
    name: "Бондаренко<br>Яков",
    title: "Яков Александрович Бондаренко",
    birthdate: "Дата рождения: 1905 год",
    birthplace: "Место рождения:Поселок Миллерево",
    bio: `Родился в крестьянской семье в посёлке Миллерово (современная Ростовская область). Украинец. <br><br>
    Образование неполное среднее, до начала Великой Отечественной войны работал в колхозе. <br><br>
    В июле 1941 года был призван в Красную Армию и отправлен на фронт. 16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков. Это сражение вошло в историю, как подвиг 28 героев-панфиловцев. Яков Бондаренко в том бою погиб. <br><br>
    Похоронен в братской могиле у деревни Нелидово. <br><br>
    По другим данным, Бондаренко Яков Александрович, стрелок 4-й роты 2-го батальона 1075-го стрелкового полка 316-й стрелковой дивизии, умер от ран 6 декабря 1941 года в московском госпитале и похоронен на Ваганьковском кладбище города Москвы
    `,
  },
  {
    name: "Васильев Илларион<br>",
    title: "Илларион Романович Васильев",
    birthdate: "Дата рождения: 5 ноября 1910 года",
    birthplace: "Место рождения:Село Мунгат",
    bio: `Родился 5 ноября 1910 году в селе Мунгат (находилось на территории современного Крапивинского района Кемеровской области, упразднено в 2019 году) в крестьянской семье. Русский.
    <br><br>
    После окончания начальной школы работал в сапожной артели и в совхозе. В 1941 году был призван в Красную Армию.
    <br><br>
    16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области Илларион Васильев в составе группы истребителей танков участвовал в отражении многочисленных атак противника, во время которых было уничтожено 18 вражеских танков. Это сражение вошло историю, как подвиг 28 героев-панфиловцев. В этом бою Илларион Васильев был тяжело ранен и доставлен местными жителями в медсанбат
    `,
  },
  {
    name: "Добробабин <br>Иван",
    title: "Иван Евстафьевич Добробабин",
    birthdate: "Дата рождения: 8 июня 1913 года",
    birthplace: "Место рождения:Село Перекоп",
    bio: `Окончил 4-х классную начальную школу. В 1928 году направился на строительство Харьковского тракторного завода, где ему поменяли фамилию «Добробаба» на «Добробабин», поступил в комсомол, окончил школу ФЗУ, затем в 1934 году переехал в Киргизию.<br><br>
    По словам самого Добробабина в передаче журналистов Куманёва и Мясникова, в 1937—1939 годах служил в РККА, участвовал в боях на Халхин-Голе, был контужен. До войны жил в Киргизии, был женат, работал фотографом, фотокорреспондентом газеты «Советская Киргизия» на строительстве Большого Чуйского канала. Жил в посёлке Кант, откуда и призван в армию в июле 1941 года. Был направлен в формировавшуюся в этих местах 316-ю стрелковую дивизию (впоследствии — 8-я гвардейская Панфиловская), в составе которой с сентября 1941 года принимал участие в боях в звании сержанта и в должности командира отделения 4-й роты 2-го батальона 1075-го (впоследствии — 23-го гвардейского) стрелкового полка. По утверждению доктора исторических наук Г. А. Куманёва, исполнял обязанности заместителя командира взвода.
    `,
  },
  {
    name: "Дутов<br>Петр",
    title: "Петр Данилович Дутов",
    birthdate: "Дата рождения: 6 августа 1916 года",
    birthplace: "Место рождения:Село Холмогоровка",
    bio: `Родился 6 августа 1916 года в крестьянской семье в селе Холмогоровка (современная Алматинская область Казахстана). Русский. Получил семилетнее образование в сельской школе, затем работал в селе Кугалы в колхозе. В 1937-1939 годах находился на действительной срочной службе в Рабоче-крестьянской Красной Армии.
    <br><br>
    В июле 1941 года Петра Дутова вновь призвали в Красную Армию и отправили на фронт. 16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков. Это сражение вошло в историю, как подвиг 28 героев-панфиловцев. В этом бою красноармеец Пётр Дутов погиб.
    `,
  },
  {
    name: "Емцов<br>Петр",
    title: "Петр Кузьмич Емцов",
    birthdate: "Дата рождения: 14 мая 1909 года",
    birthplace: "Место рождения:Село Георгиевка",
    bio: `Пётр Емцов родился 14 мая 1909 года в селе Георгиевка (ныне Локтевский район Алтайского края). Русский. <br><br>
    После окончания начального образования работал на Алтайской линии железной дороги и на станции «Новосибирск». В 1936 году окончил курсы счетоводов, работал в Алма-Ате[1]. <br><br>
    В июле 1941 года был призван в Красную Армию[1]. <br><br>
    Емцов Пётр 16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков[1]. <br><br>
    Данное сражение вошло в историю, как подвиг 28 героев-панфиловцев. Пётр Емцов погиб в этом бою. <br><br>
    `,
  },
  {
    name: "Нурсутбай<br>Есебулатов",
    title: "Нурсутбай Есебулатов",
    birthdate: "Дата рождения: 1913 год",
    birthplace: "Место рождения:Село Джансугуров",
    bio: `Родился в 1913 году в ауле Джансугуров (ныне посёлок городского типа Аксуского района Алматинской области Казахстана) в крестьянской семье. Казах. Получил начальное образование. В 1938—1941 годах работал разнорабочим в Алма-Атинском трамвайном тресте
    <br><br>
    В июне 1941 года был призван в Красную Армию и зачислен в формировавшуюся в Алма-Ате 316-ю стрелковую дивизию. Воевал в составе 2-го взвода 4-й роты 1075-го стрелкового полка
    <br><br>
    Стрелок 1075-го стрелкового полка (316-я стрелковая дивизия, 16-я армия, Западный фронт) красноармеец Есебулатов 16 ноября 1941 года в составе группы истребителей танков во главе с политруком Василием Клочковым и сержантом Иваном Добробабиным у разъезда Дубосеково Волоколамского района Московской области отражал многочисленные атаки противника. Группа, вошедшая в историю битвы под Москвой и Великой Отечественной войны, как 28 героев-панфиловцев, уничтожила 18 вражеских танков.
    <br><br>
    Похоронен в братской могиле у деревни Нелидово Волоколамского района Московской области.    
    `,
  },
  {
    name: "Каленик<br>Дмитрий",
    title: "Дмитрий Митрофанович Каленик",
    birthdate: "Дата рождения: 23 ноября 1910 года",
    birthplace: "Место рождения:Село Стеценково",
    bio: `Родился в 1910 году в селе Стеценково (ныне — в Россошанском районе Воронежской области) в крестьянской семье. Русский.
    <br><br>
    Получил начальное образование. Работал председателем сельпо в колхозе имени Будённого Гвардейского района Талды-Курганской области Казахской ССР.
    <br><br>
    В 1932-1935 годах служил в Красной Армии. В 1941 году был вновь призван в Красную Армию. Дмитрий Каленик 16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков. Это сражение вошло в историю как подвиг 28 героев-панфиловцев. В этом бою Дмитрий Каленик погиб.
    <br><br>
    `,
  },
  {
    name: "Кожубергенов<br>Даниил",
    title: "Даниил Александрович Кожубергенов",
    birthdate: "Дата рождения: 1917 год",
    birthplace: "Место рождения:Город Алма-Аты",
    bio: `Даниил получил начальное образование и устроился работать грузчиком на Алма-Атинскую табачную фабрику. В июле 1941 года его призвали в Красную Армию и зачислили в формирующуюся в городе 316-ю стрелковую дивизию. 16 ноября 4-я рота 2-го батальона 1075-го стрелкового полка, где Кожубергенов служил связным командира Клочкова, вступила в тяжёлый бой у разъезда Дубосеково.
    <br><br>
    По официальным данным, все 28 оборонявшихся воинов погибли, каждый из них был представлен к награждению званием Героя Советского Союза. Однако Кожубергенов остался жив, на несколько часов попал в плен, откуда бежал к бойцам кавалерийского корпуса Доватора. Вместе с ними он участвовал в боях, а после возвращения в тыл был арестован как сдавшийся с оружием в руках. В июле 1942 года лейтенант НКВД Соловейчик допросил Кожубергенова, который заявил, что в бою не участвовал. В списке представленных к высшей награде Даниил Кожубергенов был заменён на Аскара Кожубергенова. Даниила заключили в Таганскую тюрьму, откуда он попал в маршевую роту. В её составе он участвовал в Битве за Ржев, где был тяжело ранен. После долгого лечения в госпиталях Кожубергенова комиссовали.
    `,
  },
  {
    name: "Конкин<br>Григорий",
    title: "Григорий Ефимович Конкин",
    birthdate: "Дата рождения: 1911 год",
    birthplace: "Место рождения:Село Покровка",
    bio: `Родился в 1911 году в селе Покровка (современная Иссык-Кульская область Кыргызстана) в крестьянской семье. Русский. <br><br>
    После окончания начальной школы работал в колхозе имени В. И. Чапаева. В 1941 году был призван в Красную Армию. <br><br>
    Григорий Конкин 16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков. Это сражение вошло в историю, как подвиг 28 героев-панфиловцев. В этом бою Григорий Конкин погиб. Похоронен в братской могиле у деревни Нелидово Волоколамского района Московской области.
    `,
  },
  {
    name: "Кроючков<br>Абрам",
    title: "Абрам Иванович Крючков",
    birthdate: "Дата рождения: 1910 год",
    birthplace: "Место рождения:Село Плотава",
    bio: `Абрам Крючков родился в 1910 году в селе Плотава (ныне — Баевский район Алтайского края) в крестьянской семье. Русский. <br><br>
    Продолжительное время жил в Алма-Ате. Окончив начальную школу, работал сапожным мастером в артели имени Шаумяна. <br><br>
    Служил в Красной Армии в 1931—1933 годах, в 1941 году вновь был призван и в июне отправлен на фронт. <br><br>
    16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области Крючков Абрам Иванович в составе группы истребителей танков участвовал в отражении многочисленных атак противника, в которых было уничтожено 18 вражеских танков. Данное сражение вошло в историю, как подвиг 28-ми героев-панфиловцев. В этом бою Крючков Абрам Иванович погиб. Похоронен в братской могиле у деревни Нелидово Волоколамского района Московской области.
    `,
  },
  {
    name: "Максимов<br>Николай",
    title: "Николай Гордеевич Максимов",
    birthdate: "Дата рождения: 5 июля 1911 года",
    birthplace: "Место рождения:Село Мордовское",
    bio: `Родился 5 июля 1911 года в посёлке Мордовский (современная Ульяновская область) в семье рабочего Гордея Максимова. Русский. <br><br>
    Образование начальное. С 1933 года Николай Максимов проживал в городе Алма-Ата, где изготавливал декорации для театра. В июне 1941 года был призван в Красную Армию. <br><br>
    16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области Николай Максимов в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков. Данное сражение вошло в историю, как подвиг 28 героев-панфиловцев. В этом бою Николай Максимов погиб.
    `,
  },
  {
    name: "Митин<br>Гавриил",
    title: "Гавриил Степанович Митин",
    birthdate: "Дата рождения: 1908 год",
    birthplace: "Место рождения:Село Устьянка",
    bio: `Митин Гавриил Степанович — командир отделения 4-й роты 2-го батальона 1075-го стрелкового полка 316-й стрелковой дивизии 16-й армии Западного фронта, старший сержант. <br><br>
    Родился в 1908 году в селе Устьянка ныне Локтевского района Алтайского края в семье кузнеца. Русский. Жил и работал в посёлке Гальцовка Змеиногорского района Алтайского края, затем в городе Алма-Ата (ныне Алма-Аты, Казахстан). <br><br>
    В Красной Армии в 1929-1930 годах и с 1941 года. В действующей армии с октября 1941 года. <br><br>
    Командир отделения 4-й роты 2-го батальона 1075-го стрелкового полка (316-я стрелковая дивизия, 16-я армия, Западный фронт) старший сержант Гавриил Митин в составе группы истребителей танков во главе с политруком<br><br>
    16 ноября 1941 года участвовал в отражении многочисленных атак противника у железнодорожного разъезда Дубосеково Волоколамского района Московской области.
    `,
  },
  {
    name: "Митченко<br>Никита",
    title: "Никита Андреевич Митченко",
    birthdate: "Дата рождения: 3 апреля 1910 года",
    birthplace: "Место рождения:Село Нововладимировка",
    bio: `Родился 3 апреля 1910 года в селе Нововладимировка Акмолинского уезда (ныне — Аршалынский район Акмолинской области Республики Казахстан) в крестьянской семье. Украинец. <br><br>
    После прохождения начального образования работал в колхозе. С 1935 года жил и работал в посёлке городского типа Уштобе, Каратальского района Алматинской области. В июне 1941 года был призван в Красную Армию, в октябре того же года отправлен на фронт. <br><br>
    16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области Никита Митченко в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков. Это сражение вошло в историю, как подвиг 28 героев-панфиловцев. В этом бою Никита Митченко погиб.
    `,
  },
  {
    name: "Петренко<br>Григорий",
    title: "Григорий Алексеевич Петренко",
    birthdate: "Дата рождения: 22 ноября 1909 года",
    birthplace: "Место рождения:Село Черныши",
    bio: `Родился 22 ноября 1909 года в селе Черныши (современная Черкасская область Украины) в крестьянской семье, украинец. Окончил начальную школу, работал в колхозе. <br><br>
    С 1933 года работал в Соликамске, Пржевальске, селе Сазоновка (современный Кыргызстан)[1]. <br><br>
    В июле 1941 года Григорий Петренко был призван в Красную Армию и отправлен на фронт. 16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков. Это сражение вошло в историю, как подвиг 28 героев-панфиловцев. В этом бою Григорий Петренко погиб.
    `,
  },
  {
    name: "Сенгирбаев<br>Мусабек",
    title: "Мусабек Сенгирбаев",
    birthdate: "Дата рождения: 10 марта 1917 года",
    birthplace: "Место рождения:Село Кзыл-Арык",
    bio: `Родился 10 марта 1917 года в ауле Кзыл-Арык (ныне — Коксуский район, Жетысуская область, Казахстан) в крестьянской семье. Казах. <br><br>
    Образование неполное среднее. До призыва в Красную Армию в 1941 году работал в колхозе трактористом. <br><br>
    16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области Мусабек Сенгирбаев в составе группы истребителей танков участвовал в отражении многочисленных атак противника. Было уничтожено 18 вражеских танков. Это сражение вошло в историю, как подвиг 28 героев-панфиловцев. В этом бою Мусабек Сенгирбаев погиб.
    `,
  },
  {
    name: "Трофимов<br>Николай",
    title: "Николай Игнатьевич Трофимов",
    birthdate: "Дата рождения: 5 мая 1915 года",
    birthplace: "Место рождения:Деревня Киргизка",
    bio: `Николай Трофимов родился в селе Мальцева Курья Бийского уезда Томской губернии (ныне — Бийского района Алтайского края), в крестьянской семье. Русский. <br><br>
    Окончил 4 класса, работал каменщиком. <br><br>
    В Красную Армию призван в 1941 году. В действующей армии с августа 1941 года. <br><br>
    16 ноября 1941 года красноармеец Николай Трофимов в бою у разъезда Дубосеково Волоколамского района Московской области в составе группы истребителей танков во главе с политруком В. Г. Клочковым и сержантом И. Е. Добробабиным участвовал в отражении многочисленных атак танков и пехоты противника. <br><br>
    Группа, вошедшая в историю битвы под Москвой и Великой Отечественной войны, как 28 героев-панфиловцев, уничтожила восемнадцать вражеских танков. Николай Трофимов погиб в этом бою. Похоронен в братской могиле у деревни Нелидово Волоколамского района Московской области.
    `,
  },
  {
    name: "Тимофеев<br>Дмитрий",
    title: "Дмитрий Фомич Тимофеев",
    birthdate: "Дата рождения: 23 февраля 1907 года",
    birthplace: "Место рождения:Село Мальцева Курья Бийского уезда",
    bio: `Дмитрий Тимофеев родился 23 января (5 февраля) 1907 года в деревне Киргизка (ныне в составе города Томск) в крестьянской семье. Русский. <br><br>
    После окончания начальной школы работал на швейной фабрике № 2 в Алма-Ате. В 1941 году был призван в Красную Армию. На фронте с июля 1941 года. <br><br>
    16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области Дмитрий Тимофеев в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков. Данное сражение вошло в историю, как подвиг 28 героев-панфиловцев. Тяжелораненый боец был взят в нацистский плен и попал в концлагеря, но считался погибшим во время боя.
    `,
  },
  {
    name: "Шадрин<br>Иван",
    title: "Иван Демидович Шадрин",
    birthdate: "Дата рождения: 17 июня 1913 года",
    birthplace: "Место рождения:Село Плотниково",
    bio: `Иван Шадрин родился 17 июня 1913 года в селе Плотниково (современный Каменский район Алтайского края) в крестьянской семье. Русский. <br><br>
    Работал в колхозе, а с 1938 года на сахарном заводе в посёлке Кировский (современная Алматинская область Казахстана). В июле 1941 года был призван Иссык-Кульский РВК Киргизской ССР в Красную Армию и отправлен на фронт. <br><br>
    16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков. Это сражение вошло в историю, как подвиг 28 панфиловцев. В том бою был тяжело ранен и в бессознательном состоянии попал в плен, однако считался погибшим.
    `,
  },
  {
    name: "Шопоков<br>Дуйшенкул",
    title: "Дуйшенкул Шопоков",
    birthdate: "Дата рождения: 19 мая 1915 года",
    birthplace: "Место рождения:Село Шалта",
    bio: `Родился 19 мая 1915 в селе Шалта (ныне — в Сокулукском районе Чуйской области) в крестьянской семье. Кыргыз. <br><br>
    После окончания начального образования работал трактористом в колхозе. Член ВКП(б) с 1939 года. <br><br>
    В 1941 году был призван в Красную Армию, на фронте — с сентября 1941 года. <br><br>
    Дуйшенкул Шопоков 16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков. Данный подвиг вошёл в историю, как 28 героев-панфиловцев. В этом бою Дуйшенкул Шопоков погиб.
    `,
  },
  {
    name: "Шемякин<br>Григорий",
    title: "Григорий Маленьтевич Шемякин",
    birthdate: "Дата рождения: 19 мая 1915 года",
    birthplace: "Место рождения:Город Пржевальск",
    bio: `Родился в крестьянской семье 25 декабря 1906 года в городе Пржевальске Пржевальского уезда Семиреченской области. Русский. После окончания восьми классов школы работал мелиоратором]. <br><br>
    В июле 1941 года призван в Красную Армию. 16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области Григорий Шемякин в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено, по официальным данным, 18 вражеских танков. Данное сражение вошло в историю, как подвиг 28 героев-панфиловцев. Тяжелораненый боец был контужен во время боя.
    `,
  },
  {
    name: "Шепетков<br>Иван",
    title: "Иван Алексеевич Шепетков",
    birthdate: "Дата рождения: 1910 год",
    birthplace: "Место рождения:Город Пржевальск",
    bio: `Иван Шепетков родился в 1910 году в городе Верном в семье рабочего. Русский. После окончания 7 классов работал на строительстве Турксиба, рабочим Сталинградского тракторного завода, артистом Алма-Атинского цирка. <br><br>
    В 1941 году был призван в Красную Армию. Иван Шепетков 16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков. Данное сражение вошло в историю, как подвиг 28 героев-панфиловцев. В этом бою Иван Шепетков погиб. Похоронен в братской могиле у деревни Нелидово Волоколамского района Московской области.
    `,
  },
  {
    name: "Москаленко<br>Иван",
    title: "Иван Васильевич Москаленко",
    birthdate: "Дата рождения: 1912 год",
    birthplace: "Место рождения:Село Кордай",
    bio: `Иван Москаленко родился в 1912 году в селе Георгиевка (современный Кордайский район Жамбылской области) в крестьянской семье. Украинец[1]. <br><br>
    Образование — шесть классов. До призыва в Красную Армию в 1941 году работал счетоводом в конторах связи Джети-Огузского района Иссык-Кульской области Киргизской ССР[1]. <br><br>
    16 ноября 1941 года у разъезда Дубосеково Волоколамского района Московской области Иван Москаленко в составе группы истребителей танков участвовал в отражении многочисленных атак противника, было уничтожено 18 вражеских танков[1]. Это сражение вошло в историю, как подвиг 28 героев-панфиловцев. В этом бою Иван Москаленко погиб[2].
    `,
  },
];
const htmlValue = (data) => `<div id="header-container">
      <header>
        <h1>ITLyceum54</h1>
        <nav>
          <a href="../index.html">Главная</a>
          <a href="../index.html#GreatFeat">Лидеры</a>
          <a href="../index.html#MembersList">Панфиловцы</a>
          <a href="../index.html#MembersAwards">Список</a>
        </nav>
      </header>
    </div>

    <section id="Main">
      <div id="M-Name">
        <h1>
        ${data.name}
        </h1>
      </div>
      <div id="M-MainText">
        <div id="M-MT-Image">
          <img src="../images/Cards-images/${data.title}.png" alt="" />
        </div>
        <div id="M-MT-Description">
          <h1>${data.title}</h1>
          <p>${data.birthdate}</p>
          <p>${data.birthplace}</p>
          <p>
            ${data.bio}
          </p>
        </div>
      </div>
    </section>`;
function renderCards(data) {
  // data.forEach(person => {
  const card = document.getElementById("body");
  card.innerHTML = htmlValue(data);
  // });
}

// Вызов функции для рендера
renderCards(people[localStorage.getItem("pageNumber")]);
